# Andrea Rodríguez Yáñez

*Uso de SQL en ejercicio de tablas de indexmundi*

In [1]:
import sqlite3
import os
import pandas as pd
import requests

In [2]:
connection1 = sqlite3.connect("death_rate.db")
connection2 = sqlite3.connect("HBD.db")
connection3 = sqlite3.connect("obesity.db")

In [3]:
file1 = 'death_rate.txt'
file2 = 'HBD.txt'
file3 = 'obesity.txt'


DR = pd.read_csv(file1, sep='\t',engine = 'python', header=None)
HBD = pd.read_csv(file2, sep='\t',engine = 'python', header=None)
OB = pd.read_csv(file3, sep='\t',engine = 'python', header=None)


DR.columns = ['country', 'deathrate', 'year']
HBD.columns = ['country', 'density', 'year']
OB.columns = ['country', 'percent', 'year']

In [4]:
DR.to_sql('DR_SQL', connection1)
HBD.to_sql('HBD_SQL', connection2)
OB.to_sql('OB_SQL', connection3)

Para reducir las tablas

In [9]:
sql_ord = 'SELECT country, deathrate FROM DR_SQL'
C_DR = pd.read_sql(sql_ord, connection1)
sql_ord = 'SELECT country, density FROM HBD_SQL'
C_HBD = pd.read_sql(sql_ord, connection2)
sql_ord = 'SELECT country, percent FROM OB_SQL'
C_OB = pd.read_sql(sql_ord, connection3)

In [10]:
C_DR

                  country  deathrate
0                 Lesotho         15
1               Lithuania         15
2                  Latvia         15
3                Bulgaria         15
4                 Ukraine         14
..                    ...        ...
192          Saudi Arabia          3
193               Bahrain          3
194                Kuwait          2
195  United Arab Emirates          2
196                 Qatar          2

[197 rows x 2 columns]

In [11]:
C_HBD

          country  density
0          Monaco       14
1           Japan       13
2    Korea, North       13
3    Korea, South       12
4         Belarus       11
..            ...      ...
167        Guinea        0
168      Ethiopia        0
169          Iran        0
170    Madagascar        0
171          Mali        0

[172 rows x 2 columns]

In [13]:
C_OB

        country  percent
0         Nauru       61
1         Palau       55
2        Tuvalu       52
3         Tonga       48
4         Samoa       47
..          ...      ...
180       India        4
181    Cambodia        4
182  East Timor        4
183  Bangladesh        4
184     Vietnam        2

[185 rows x 2 columns]

¿Cuáles son los países con mayor taza de muerte?

In [14]:
sql_ord = 'SELECT * FROM DR_SQL WHERE deathrate> 13'
mayorq13_DR = pd.read_sql(sql_ord, connection1)
mayorq13_DR

   index    country  deathrate  year
0      0    Lesotho         15  2018
1      1  Lithuania         15  2018
2      2     Latvia         15  2018
3      3   Bulgaria         15  2018
4      4    Ukraine         14  2018
5      5     Serbia         14  2018

¿Cuál es el porcentaje de países cuya obesidad es mayor a 30%?

In [15]:
#obtener valores totales
sql_ord = 'SELECT count(country) FROM OB_SQL'
Contar_valores = pd.read_sql(sql_ord, connection3)
a = Contar_valores['count(country)']

In [16]:
#obtener valores mayores que 30
sql_ord = 'SELECT count(case when percent > 30 then 1 end) FROM OB_SQL'
Contar_porcentaje = pd.read_sql(sql_ord, connection3)
b = Contar_porcentaje['count(case when percent > 30 then 1 end)']

In [17]:
#resultado
100*b/a

0    9.72973
dtype: float64

¿Cuál es el porcentaje de países cuya saturación de camas es menor a 5%?

In [18]:
#obtener valores totales
sql_ord = 'SELECT count(country) FROM HBD_SQL'
Contar_valores = pd.read_sql(sql_ord, connection2)
a = Contar_valores['count(country)']

In [19]:
#obtener valores mayores que 30
sql_ord = 'SELECT count(case when density < 5 then 1 end) FROM HBD_SQL'
Contar_porcentaje = pd.read_sql(sql_ord, connection2)
b = Contar_porcentaje['count(case when density < 5 then 1 end)']

In [20]:
100*b/a

0    73.837209
dtype: float64